__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 16, 16, 64)   9472        input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 16, 16, 64)   256         conv2d_1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 16, 16, 64)   0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 8, 8, 64)     0           activation_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 8, 8, 64)     36928       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 8, 8, 64)     256         conv2d_2[0][0]
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 8, 8, 64)     0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 8, 8, 64)     0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 8, 8, 64)     0           lambda_1[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 8, 8, 64)     36928       activation_2[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 8, 8, 64)     36928       activation_3[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 8, 8, 64)     0           conv2d_3[0][0]
                                                                 conv2d_4[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 8, 8, 64)     0           max_pooling2d_1[0][0]
                                                                 add_1[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 8, 8, 64)     256         add_2[0][0]
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 8, 8, 64)     0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 8, 8, 64)     0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 8, 8, 64)     0           lambda_2[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 8, 8, 64)     36928       activation_4[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 8, 8, 64)     36928       activation_5[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 8, 8, 64)     0           conv2d_5[0][0]
                                                                 conv2d_6[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 8, 8, 64)     256         add_3[0][0]
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 8, 8, 64)     0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 8, 8, 64)     0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 8, 64)     0           lambda_3[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 8, 8, 64)     36928       activation_6[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 8, 8, 64)     36928       activation_7[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 8, 8, 64)     0           conv2d_7[0][0]
                                                                 conv2d_8[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 8, 8, 64)     0           add_2[0][0]
                                                                 add_4[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 8, 8, 64)     256         add_5[0][0]
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 8, 8, 64)     0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 8, 64)     0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 8, 8, 64)     0           lambda_4[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 4, 4, 128)    73856       activation_8[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 4, 4, 128)    73856       activation_9[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 4, 4, 128)    0           conv2d_9[0][0]
                                                                 conv2d_10[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 4, 4, 128)    512         add_6[0][0]
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 4, 4, 128)    0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 4, 4, 128)    0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 4, 4, 128)    0           lambda_5[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 4, 4, 128)    147584      activation_10[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 4, 4, 128)    147584      activation_11[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 4, 4, 128)    8320        add_5[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, 4, 4, 128)    0           conv2d_11[0][0]
                                                                 conv2d_12[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, 4, 4, 128)    0           conv2d_13[0][0]
                                                                 add_7[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 4, 4, 128)    512         add_8[0][0]
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 4, 4, 128)    0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 4, 4, 128)    0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 4, 4, 128)    0           lambda_6[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 4, 4, 128)    147584      activation_12[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 4, 4, 128)    147584      activation_13[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, 4, 4, 128)    0           conv2d_14[0][0]
                                                                 conv2d_15[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 4, 4, 128)    512         add_9[0][0]
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, 4, 4, 128)    0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 4, 4, 128)    0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 4, 4, 128)    0           lambda_7[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 4, 4, 128)    147584      activation_14[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 4, 4, 128)    147584      activation_15[0][0]
__________________________________________________________________________________________________
add_10 (Add)                    (None, 4, 4, 128)    0           conv2d_16[0][0]
                                                                 conv2d_17[0][0]
__________________________________________________________________________________________________
add_11 (Add)                    (None, 4, 4, 128)    0           add_8[0][0]
                                                                 add_10[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 4, 4, 128)    512         add_11[0][0]
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, 4, 4, 128)    0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 4, 4, 128)    0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 4, 4, 128)    0           lambda_8[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 2, 2, 256)    295168      activation_16[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 2, 2, 256)    295168      activation_17[0][0]
__________________________________________________________________________________________________
add_12 (Add)                    (None, 2, 2, 256)    0           conv2d_18[0][0]
                                                                 conv2d_19[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 2, 2, 256)    1024        add_12[0][0]
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, 2, 2, 256)    0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 2, 2, 256)    0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 2, 2, 256)    0           lambda_9[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 2, 2, 256)    590080      activation_18[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 2, 2, 256)    590080      activation_19[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 2, 2, 256)    33024       add_11[0][0]
__________________________________________________________________________________________________
add_13 (Add)                    (None, 2, 2, 256)    0           conv2d_20[0][0]
                                                                 conv2d_21[0][0]
__________________________________________________________________________________________________
add_14 (Add)                    (None, 2, 2, 256)    0           conv2d_22[0][0]
                                                                 add_13[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 2, 2, 256)    1024        add_14[0][0]
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 2, 2, 256)    0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 2, 2, 256)    0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 2, 2, 256)    0           lambda_10[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 2, 2, 256)    590080      activation_20[0][0]
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 2, 2, 256)    590080      activation_21[0][0]
__________________________________________________________________________________________________
add_15 (Add)                    (None, 2, 2, 256)    0           conv2d_23[0][0]
                                                                 conv2d_24[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 2, 2, 256)    1024        add_15[0][0]
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 2, 2, 256)    0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 2, 2, 256)    0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 2, 2, 256)    0           lambda_11[0][0]
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 2, 2, 256)    590080      activation_22[0][0]
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 2, 2, 256)    590080      activation_23[0][0]
__________________________________________________________________________________________________
add_16 (Add)                    (None, 2, 2, 256)    0           conv2d_25[0][0]
                                                                 conv2d_26[0][0]
__________________________________________________________________________________________________
add_17 (Add)                    (None, 2, 2, 256)    0           add_14[0][0]
                                                                 add_16[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 2, 2, 256)    1024        add_17[0][0]
__________________________________________________________________________________________________
lambda_12 (Lambda)              (None, 2, 2, 256)    0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 2, 2, 256)    0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 2, 2, 256)    0           lambda_12[0][0]
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 1, 1, 512)    1180160     activation_24[0][0]
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 1, 1, 512)    1180160     activation_25[0][0]
__________________________________________________________________________________________________
add_18 (Add)                    (None, 1, 1, 512)    0           conv2d_27[0][0]
                                                                 conv2d_28[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 1, 1, 512)    2048        add_18[0][0]
__________________________________________________________________________________________________
lambda_13 (Lambda)              (None, 1, 1, 512)    0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 1, 1, 512)    0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 1, 1, 512)    0           lambda_13[0][0]
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 1, 1, 512)    2359808     activation_26[0][0]
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 1, 1, 512)    2359808     activation_27[0][0]
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 1, 1, 512)    131584      add_17[0][0]
__________________________________________________________________________________________________
add_19 (Add)                    (None, 1, 1, 512)    0           conv2d_29[0][0]
                                                                 conv2d_30[0][0]
__________________________________________________________________________________________________
add_20 (Add)                    (None, 1, 1, 512)    0           conv2d_31[0][0]
                                                                 add_19[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 1, 1, 512)    2048        add_20[0][0]
__________________________________________________________________________________________________
lambda_14 (Lambda)              (None, 1, 1, 512)    0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 1, 1, 512)    0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 1, 1, 512)    0           lambda_14[0][0]
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 1, 1, 512)    2359808     activation_28[0][0]
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 1, 1, 512)    2359808     activation_29[0][0]
__________________________________________________________________________________________________
add_21 (Add)                    (None, 1, 1, 512)    0           conv2d_32[0][0]
                                                                 conv2d_33[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 1, 1, 512)    2048        add_21[0][0]
__________________________________________________________________________________________________
lambda_15 (Lambda)              (None, 1, 1, 512)    0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 1, 1, 512)    0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 1, 1, 512)    0           lambda_15[0][0]
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 1, 1, 512)    2359808     activation_30[0][0]
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 1, 1, 512)    2359808     activation_31[0][0]
__________________________________________________________________________________________________
add_22 (Add)                    (None, 1, 1, 512)    0           conv2d_34[0][0]
                                                                 conv2d_35[0][0]
__________________________________________________________________________________________________
add_23 (Add)                    (None, 1, 1, 512)    0           add_20[0][0]
                                                                 add_22[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 1, 1, 512)    2048        add_23[0][0]
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 1, 1, 512)    0           batch_normalization_17[0][0]
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 512)    0           activation_32[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 512)          0           average_pooling2d_1[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           5130        flatten_1[0][0]
==================================================================================================
Total params: 22,144,842
Trainable params: 22,137,034
Non-trainable params: 7,808
__________________________________________________________________________________________________